const mbtiQuestions = [



  
  {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "تۆ زۆر حەزت دەستپێکردنی پڕۆژەی نوێ و گەڕان بەدوای هەموو بژاردەکاندا بۆ دۆزینەوەی باشترین ڕێگا. نموونە لە کاتی بازاڕکردن بە شێوەی ئۆنلاین، چەندین تاب دەکەیتەوە بۆ بەراوردکردن و هەڵبژاردنی باشترینەکان.",

      "تۆ زۆر حەزت لە تەواوکردنی پڕۆژەکانە و کردارت پێ باشترە لە کامڵبوون. نموونە لە کاتی بازاڕکردن بە شێوەی ئۆنلاین، بە خێرایی بژاردەیەکی باش هەڵدەبژێریت بۆ ئەوەی بتوانیت بچیتە پێشەوە."
    ],
functions: [
  { name: "Ti", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Te", scale: [0, 1, 2, 3] }
]
  },




  {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "بیرۆکەکانت بۆ دواتر پاشەکەوت دەکەیت و حەز دەکەیت بزانیت شتەکان چۆن کاردەکەن. نموونە بۆ ڕووداوێک، بیرۆکە و ئەزموونەکانی ڕابردوو بەکاردەهێنیت بۆ ئەوەی باشتر بێت.",
"تۆ باشیت لە پلاندانان و مامەڵەکردن لەگەڵ کێشەکان. نموونە لە تیمی بۆنەیەکدا، تۆ بەرپرسیارێتی بڕیاردان لەسەر بابەتەکە دەگریتە ئەستۆ، تەنانەت ئەگەر هەندێک کەسیش دڵتەنگ بکات."
    ],
functions: [
  { name: "Ti", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Te", scale: [0, 1, 2, 3] }
]
  },





 {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "تۆ حەز دەکەیت کۆنتڕۆڵککەر بیت و ناتەوێت زۆر بۆچوون خاوت بکاتەوە. نموونە: کاتێک کات لە پرۆژەیەکی گروپیدا شتێک کەم بوو، بڕیاری خێرا ئەدەیت بۆ ئەوەی لە کاتی خۆیدا تەواوی بکەیت.",
      "چێژ لە دۆزینەوەی جیاوازییەکان و ڕیزکردنی شتەکان بە شێوەیەک وەردەگریت. نموونە تۆ حەزت لە تاقیکردنەوەی تام و چێژە قاوە یان شەراب و گروپکردنیان بەپێی تایبەتمەندییە هاوبەشەکانیان."
    ],
  functions: [
  { name: "Ti", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Te", scale: [0, 1, 2, 3] }
]
  },






 {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "فێربوونت حەز لێیەو لە سەرووی هەموو شتێکەوە گرنگی بە وردبینی ئەدەیت. نموونە لە کۆکردنەوەی مێشکدا، هەندێک جار بە قووڵی بیرۆکەکان دەکۆڵیتەوە پێش ئەوەی سەرنجت لەسەر ئامانجی سەرەکی بێت.",

      "تۆ ئەنجامێکت دەوێت کە بە باشی کار بکات بەبێ ئەوەی سەرنجت لەسەر هەموو وردەکارییەکان بێت. نموونە کاتێک هاوکارێک ڕاپۆرتێکت پێدەدات، زۆرترین گرنگی بە ئەنجامی کۆتاییەکان و ئەگەر چیرۆکێکی دروست بگێڕنەوە."
    ],
functions: [
  { name: "Ti", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Te", scale: [0, 1, 2, 3] }
]
  },




 {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "فێربوونت حەز لێیەو گرنگی بە وردبینیەکان ئەدەیت، سەرچاوەکە گرنگ نییە. نموونە لە کۆکردنەوەی مێشکدا، هەندێک جار بە قووڵی خۆت دەخزێتە ناو بیرۆکەکانەوە پێش ئەوەی سەرنجت لەسەر ئامانجی سەرەکی بێت.",


      "تۆ شتێکت دەوێت کە بە باشی کار بکات و سەرنجت لەسەر ئەنجامەکە بێت نەک هەموو هەنگاوەکان. نموونە کاتێک هاوکارێک ڕاپۆرتێکت پێدەدات، بە شێوەیەکی سەرەکی پشکنین دەکەیت کە ئایا ژمارەکان ئەو چیرۆکە دەگێڕنەوە کە تۆ دەتەوێت."
    ],
functions: [
  { name: "Ti", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Te", scale: [0, 1, 2, 3] }
]
  },




  {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "تۆ بڕیار دەدەیت کە چی ڕاستە یان هەڵەیە بە پشتبەستن بە هەست و بەهاکانی خۆت، نەک ئەوەی زۆربەی خەڵک بیری لێدەکەنەوە.  \n نموونە: تۆ لەبری یاساکانی کۆمەڵگا یاساکانی خۆت جێبەجێ دەکەیت.",
      "تۆ بە یاساکانی کۆمەڵگا حوکم لەسەر ڕاست و هەڵە ئەکەیت.\n  نموونە تێبینی دەکەیت کاتێک کەسێک ڕەوشت یان ئاداب دەشکێنێت، تەنانەت ئەگەر لەگەڵ هەموو یاساکاندا هاوڕا نەبیت."
    ],
functions: [
  { name: "Fi", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Fe", scale: [0, 1, 2, 3] }
]
  },



  {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "تۆ نرخی ڕاستگۆیی لا گرنگە و ڕقت لە هەر شتێکی ساختەیە. \n نموونە تۆ تێناگەیت بۆچی مرۆڤەکان ئەخلاقەکانیان دەگۆڕن، وەک درۆکردن تەنها بۆ ئەوەی وا لە کەسێک بکات هەست بە باشتربوون بکات.",
      "تۆ گرنگی بە هەستی کەسانی تر دەدەیت و هەوڵدەدەیت ئاسوودەیان بکەیت.\n  نموونە تۆ لەبارەی خۆتەوە کراوەیت و هەندێک جار ڕەفتارەکانت دەگۆڕیت بۆ ئەوەی یارمەتی گروپەکە بدەیت هەست بە باشی بکات."
    ],
 functions: [
  { name: "Fi", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Fe", scale: [0, 1, 2, 3] }
]
  },







  {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "هەستی گروپی ناڕەحەتت دەکات چونکە تەنها مامەڵە لەگەڵ هەستەکانی خۆت دەکەیت. نموونە: تۆ حەزت لە دانیشتن نییە لە بازنەیەکدا کە خەڵک شتە کەسییەکانیان تێدا هاوبەشە و پشتگیری بەدەست بهێنن.",
      "تۆ گروپەکە بە ئارامی دەهێڵیتەوە بە یارمەتیدانی خەڵک بۆ ڕازیبوون. نموونە کاتێک کەسانی تر شەڕ دەکەن هەوڵدەدەیت یارمەتیان بدەیت پێکەوە بژین."
    ],
functions: [
  { name: "Fi", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Fe", scale: [0, 1, 2, 3] }
]
  },




 {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "تۆ سەرنجت لەسەر ئەوە دەبێت کە چی ڕاستە و شتەکان چۆن دەبن. نموونە حەزت لە باسکردنە لەوەی کە کۆمەڵگا دەبێت چ شتێک پەیڕەو بکات.",
      "تۆ زیاتر بە هەستەکانت بڕیاڕ لەسەر دۆخەکان دەدەیت نەک ڕاستییەکان. نموونەی ئامۆژگاری لە کەسانی تر زۆرجار ناگونجێت چونکە دۆخەکەت هەست بە جیاوازە."
    ],
functions: [
  { name: "Fi", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Fe", scale: [0, 1, 2, 3] }
]
  },






 {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "تێبینی ئەوە دەکەیت کە چۆن شتەکان هەستت پێدەکەن و هەستەکانت لە ڕێگەی هونەر یان ئەزموونەکانەوە دەردەبڕیت. نموونە تۆ لە نزیکەوە گرنگی بەو شتانە دەدەیت کە خەڵک و ڕووداوەکان کاریگەرییان لەسەر باری دەروونیت هەیە و بە شێوازی داهێنەرانە نیشانی دەدەیت.",
      "سەرنجی هەستی کەسانی تر دەدەیت و هەوڵدەدەیت یارمەتیان بدەیت. نموونە هەست بە پەیوەندیەک ئەکەیت لەگەڵ کەسانی تردا چونکە هەستەکانیان کاریگەری لەسەرت هەیە."
    ],
functions: [
  { name: "Fi", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Fe", scale: [0, 1, 2, 3] }
]
  },



 {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "تۆ دۆخی ئێستات بەراورد دەکەیت بە ئەزموونەکانی ڕابردوو و ئەوەی هەست بە ئاسایی دەکەیت. نموونە لە گەشتێکدا، تێبینی ئەوە دەکەیت کە چی جیاوازە یان کە سەختیەکی ترت بیردەخاتەوە.",
      "تۆ سەرنجت لەسەر ئەو شتانەیە کە لە ئێستادا لە دەوروبەرت ڕوودەدەن و بە هەستەکانت سەرنجی وردەکارییەکان دەدەن. نموونە لە کاتی گەشتێکدا، دەتەوێت دەست لە دارەکان بدەیت، بۆنی گوڵ بکەیت و هەست بە خۆر بکەیت لەسەر پێستت."
    ],
 functions: [
  { name: "Si", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Se", scale: [0, 1, 2, 3] }
]
  },




 {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "تۆ جیهان وەک خۆی دەبینیت بەبێ ئەوەی بۆچوونی خۆت زیاد بکەیت. نموونە چێژ لە ئامادەبوونی تەواو و ڕەفتارکردنی سروشتی و هەستکردن بە هەموو شتێک لە دەوروبەرت وەردەگریت.",
      "تۆ بە پشتبەستن بە ئەزموونەکانی ڕابردووت لە شتە نوێیەکان تێدەگەیت. نموونە تۆ بە وریاییەوە بەرەو ئامانجەکەت دەڕۆیت، ئەوەی دەیبینیت بەراورد دەکەیت بەو شتانەی کە پێشتر زانیوتە."
    ],
functions: [
  { name: "Si", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Se", scale: [0, 1, 2, 3] }
]
  },




 {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "حەزت لە پاراستنی نەریتەکانە و شتە ئاشناکانت پێ باشترە. شتە نوێیەکان کاتیان دەوێت تا قبوڵیان بکەیت. نموونە زۆرجار بلوزێکی دڵخوازت لەبەر دەکەیت یان ژەمێکی دڵخوازت دەخۆیت و لەوانەیە هێواش هێواش دەست بکەیت بە حەزکردن لە خواردنە نوێیەکان ئەگەر زیاتر تاقییان بکەیتەوە.",
      "سەرنجی شتە ڕاستەقینەکانی دەوروبەرت دەدەیت وەک دیمەن و بۆن و ڕەوتەکان. نموونە بۆنی نوێی هاوکارەکەت یان ئەو پێڵاوە بەناوبانگانەی کە هەمووان لەبەریان کردووە دەبینیت."
    ],
functions: [
  { name: "Si", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Se", scale: [0, 1, 2, 3] }
]
  },





 {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "تۆ زۆر ئاگاداری نیشانەکانی جەستەت وەک ئازار و برسێتی و تینوێتی. نموونە دەتوانیت بە ڕوونی باسی ئەوە بکەیت کە جەستەت چۆن هەست دەکات لە کاتی هەستەکاندا، وەک دڵێکی خێرا یان پێستی چرچ و لۆچ.",
      "چێژ لە جوانی و هەستی جەستەیی نوێ وەردەگریت. نموونە هەست بە وروژاندن دەکەیت بەهۆی ئەدرنالین لە وەرزشەوە یان هەستکردن بە قوماشێکی ناوازە."
    ],
 functions: [
  { name: "Si", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Se", scale: [0, 1, 2, 3] }
]
  },






 {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "بە بەراوردکردنی زانیاری نوێ لەگەڵ ئەزموون و ڕۆتینەکانی ڕابردووت فێردەبیت. نموونە تۆ پێت باشە پێش ئەوەی کار بکەیت پلانی ورد دابنێیت.",
      "زۆرجار چاوەڕێی یارمەتی کەسێک دەکەیت بۆ ئەوەی هەنگاو بنێیت. نموونە هەست دەکەیت گیرت خواردووە تا شتێک یان کەسێک پاڵت پێدەنێت بۆ دەستپێکردن."
    ],
functions: [
  { name: "Si", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Se", scale: [0, 1, 2, 3] }
]

  },




 {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "حەز دەکەیت خێرا بڕیار بدەیت و دەست بە کارەکەت بکەیت. ڕوانگەی جیاواز دەبینیت و تێبینی هەست دەکەیت. نموونە تۆ خێرا دەست پێدەکەیت بەڵام هەندێک جار هەڵیدەبژێریت بەبێ ئەوەی بیر لە هەموو بژاردەکان بکەیتەوە.",
      "تۆ بیرێکی کراوەیت و حەزت لە ڕۆتین نییە. پێویستت بە وروژاندنی دەروونییە. نموونە تۆ زیاتر چێژ لە فێربوون لە کەسانی تر و بیستنی بیرۆکەی نوێ و گفتوگۆی قووڵ وەردەگریت لەوەی تەنها لە دەوروبەری خەڵکدا بیت."
    ],
functions: [
  { name: "Ni", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Ne", scale: [0, 1, 2, 3] }
]

  },





 {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "تۆ سەرنجت لەسەر چەند بابەتێکە و بیرۆکەکان بە یەک بابەتی ڕوون دەیبەستیتەوە. نموونە تۆ بیر لە ئەگەرەکان دەکەیتەوە لە مێشکتدا و بیرۆکەکەت تەنها کاتێک هاوبەش دەکەیت کە ئامادەیە.",
      "خولیای زۆرت هەیە و حەزت لە گەڕان بەدوای بابەتی جیاوازدایە. نموونە تۆ بە زۆر بەرز بیردەکەیتەوە بۆ ئەوەی بیرۆکەکان بکۆڵیتەوە و بزانیت هەستت چۆنە بەرامبەریان."
    ],
functions: [
  { name: "Ni", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Ne", scale: [0, 1, 2, 3] }
]

  },








 {
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "تۆ سەرنجت لەسەر ئامانجەکانت دەبێت و لە ناخەوە دەگەڕێیت بۆ بیرۆکەکان بۆ ئەوەی بگەیتە ئەو ئامانجانە. نموونە زۆرجار سەردانی هەمان بیرۆکەکان دەکەیتەوە، لە گۆشەنیگای جیاوازەوە پاڵاوتیان دەکەیتەوە.",
      "ڕاستییەکان لە جیهانەوە کۆدەکەیتەوە و دەیانبەستیتەوە بە بیرۆکەی نوێ. نموونە داهاتووتان پێشبینی نەکراوە چونکە زۆرجار بەرژەوەندییەکانت دەگۆڕێن."
    ],
functions: [
  { name: "Ni", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Ne", scale: [0, 1, 2, 3] }
]

  },











{
  question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
  options: [
    "تۆ سەرنجت لەسەر چەند بیرۆکەیەکی بەهێزە و باقیەکەی پشتگوێ دەخەیت. نموونە تۆ سەرقاڵکردنەکان دوور ئەکەویتەوە بۆ ئەوەی باشترین بیرۆکەکان دروست بکەیت.",
    "حەزت لە هەبوونی بیرۆکەی زۆرە بەڵام بەزەحمەت یەکێکیان هەڵبژێریت. نموونە مێشکت بەردەوام بیرۆکەکان لە هەموو ئاراستەکاندا گەشە دەکات."
  ],
functions: [
  { name: "Ni", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Ne", scale: [0, 1, 2, 3] }
]

},






{
    question: "یەکێک لەو دووانەی خوارەوە هەڵبژێرە کە زیاتر لەگەڵت دەگونجێت",
    options: [
      "مێشکت کاتێک کاردەکات، دەبێتە هۆی ساتەکانی کتوپڕی بڵێیت ئەها. نموونە زۆرجار باشترین بیرۆکەکانت دوای ماوەیەک دەردەکەون.",
      "مێشکت بە بیرۆکە چالاک دەبێت، شتەکان باشتر دەبن و پەیوەندی شاراوە دەدۆزێتەوە. نموونە باشترین بیرۆکەکانت دروست دەکەیت بە قسەکردنی چالاکانە، وێنەکێشان، یان کارکردن لەگەڵ کەسانی تر."
    ],
functions: [
  { name: "Ni", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Ne", scale: [0, 1, 2, 3] }
]
  },




{
    question: "چۆن وزەی خۆت لەگەڵ کەسەکان و شتەکانی تر بەکاردێنیت؟",
    options: [
      "تۆ سەرنجت لەسەر ئەنجامدانی کارەکان و گەیشتن بە ئامانجەکانە. تۆ گرنگی بە ئەنجامە ڕاستەقینەکان دەدەیت نەک تەنها هەوڵدان بەم شێوەیەش بیر ئەکەیتەوە بۆ تەواوکردنی ئەم ئەرکە یان گەیشتن بەم ئامانجە پێویستم بە چییە؟ \n چۆن بتوانم یارمەتی کەسانی تر یان تیمەکەم بدەم بە شێوەیەکی کارا کاربکەن بۆ ئەوەی سەرکەوتوو بن؟ \n",
      "تۆ سەرنجت لەسەر خەڵک و هێشتنەوەی هەمووان پێکەوەیە گرنگی بە هەستی ئەوانی تر دەدەیت و دەتەوێت کەس هەست بە جێهێشتن نەکات. بەم شێوەیەش بیر ئەکەیتەوە\n  چی زۆرترین یارمەتی گروپەکە دەدات؟ خەڵک چۆن پێکەوە دەژین؟ \n چۆن بتوانم پەیوەندی لەگەڵ کەسانی تردا دروست بکەم و پەیوەندییەکانمان باشتر بکەین؟"
    ],
functions: [
  { name: "Te", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Fe", scale: [0, 1, 2, 3] }
]
  },






{
    question: "خۆت گرنگی بە چی دەدەیت؟",
    options: [
      "تۆ شوێن ئەو شتە دەکەویت کە هەست دەکەیت ڕاستە تۆ بەم شێوەیە بیردەکەیتەوە \n  متمانە بە هەستەکانم بکە.  چی  \n ڕاستە و لەگەڵ ئەو کەسەدا دەگونجێت دەمەوێت کێ بم؟",
      "تۆ دوای ئەو شتانە دەکەویت کە زیاتر ڕوون دەردەکەوێت. تۆ پێت وایە \n چی ڕاست و دروستە؟ چ لایەنگرییەکم؟ \n  لایەنە باش و خراپە سەرەکییەکانی ئەم بڕیارە چین؟"
    ],
functions: [
  { name: "Fi", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Te", scale: [0, 1, 2, 3] }
]
  },


{
    question: "زیاتر چێژ لە کامیان وەردەگریت",
    options: [
      "چێژ لە گەڕان بەدوای بیرۆکە و نەخشەو و پەیوەندییەکان وەردەگریت. بەم شێوەیە بیر ئەکەیتەوە \n   چۆن بتوانم داهێنان بکەم \n  هەموو ئەم پارچانە چۆن پەیوەندییان بەیەکەوە هەیە؟\n هەموو بیرۆکە ئەگەرییەکان چین؟\n ",
      "چێژ لە هەستە جەستەییەکان و ئەو جیهانە وەردەگریت کە دەتوانیت دەستی لێبدەیت و بیبینیت. بەم شێوەیە بیر ئەکەیتەوە لە ئێستادا چی بکەم؟ ئەو کێشانەی ڕووبەڕووم دەبننەوە چارەسەریان ئەکەم \n"
    ],
functions: [
  { name: "Ne", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Se", scale: [0, 1, 2, 3] }
]
  },




{
    question: "بەزۆری سەرنجی چی ئەدەیت یان زۆرترین سەرنجت لەسەر چییە؟",
    options: [
      "تۆ سەرنجت لەسەر ئەوەیە کە بەڕاستی لە ژێر ڕووی ڕووکەشدا چی ڕوودەدات. تۆ بەم شێوەیە بیر ئەکەیتەوە \n ئەمە چۆن لەگەڵ ئامانجەکانم و دیدگای داهاتوودا دەگونجێت؟ \n متمانەم بە شارەزایی کەسانی ترە،\n  بەڵام ئەگەر شتێکی باشترم دۆزیەوە دەیگۆڕم",
      "تۆ سەرنجت لەسەر شێوازە سەلمێنراوەکان و ئامۆژگارییە متمانەپێکراوەکانە. تۆ بەم شێوەیە بیر دەکەیتەوە: n ئەوەی پێشتر ئەوان کاریان بۆی کردووە بەکاری دەهێنم. \n ڕێز لە ڕێگا دامەزراوەکان دەگرم و هەمیشە بەدواداچوون دەکەم"
    ],
functions: [
  { name: "Ni", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Si", scale: [0, 1, 2, 3] }
]
  },






{
  question: "سەر بە کام جۆرەیت دیاری بکە؟",
  options: ["ڕێکخراویت (ڕیزبەندی، وردەکاری، سەقامگیری) تۆ حەزت لە پێکهاتە و یاسا و ئاسایشە. تۆ سەرنجت لەسەر شتە ڕاستەقینەکانە نەک بیرۆکەی خەیاڵ هەست بە بەرپرسیارێتی دەکەیت، ڕێز لە دەسەڵات دەگریت و بەهای جێبەجێکردنی ئەرکەکەت دەدەیت. تۆ زۆر کار دەکەیت و شانازی بەوە دەکەیت کە هەمیشە کارەکان لە کاتی خۆیدا ئەنجام دەدەیت."],
  functions: [
    { name: "Si", scale: [0, 1, 2, 3] }
  ]
},

{
  question: "سەر بە کام جۆرەیت دیاری بکە؟",
  options: ["ئەزمووندار (فیزیکییەن) تۆ لە ساتەوەختەکەدا دەژیت، سەرنجت لەسەر ئەنجامە ڕاستەقینەکانە و کاتێکی خۆش بەسەر دەبەیت نەک تیۆرییەکان یان داهاتوو. ئازادی و خۆبەخۆیی و گونجاندن بە نرخ دەزانیت و حەزت لە یاسا توندەکان نییە. تۆ لە ژێر فشاردا بە باشی کار دەکەیت، هەرچی کار بکات بۆ ئەوەی کارەکان بە ئەنجام بگەیەنیت ئەنجامی دەدەیت."],
  functions: [
    { name: "Se", scale: [0, 1, 2, 3] }
  ]
},



{
  question: "سەر بە کام جۆرەیت دیاری بکە؟",
  options: ["گەشبینیت دەربارەی (خەڵک، هەست، نرخ) گرنگی بە یارمەتیدانی کەسانی تر و دروستکردنی داهاتوویەکی باشتر دەدەیت. بیر لەوە دەکەیتەوە کە چی ڕاست و دادپەروەرە. چێژ لە تێگەیشتن لە هەستەکان و یارمەتیدانی خەڵک بۆ گەشەکردن و دروستکردنی پەیوەندی بەهێز وەردەگریت. تۆ بە جۆش و خرۆش و خەمخۆری و شوێن خەون و ئامانجەکانت دەکەویت."],
  functions: [
    { name: "Fi", scale: [0, 1, 2, 3] }
  ]
},



{
  question: "سەر بە کام جۆرەیت دیاری بکە؟",
  options: ["چاکسیزیت (ئامانجی گەورە) تۆ لۆژیکی و بابەتیی و حەزت لە شیکردنەوەی زانیارییە. تۆ بەدوای نەخشەکاندا دەگەڕێیت، لایەنە باش و خراپەکانی کێش دەکەیت و سەرنجت لەسەر ئامانجە گەورەکە و داهاتووە. تۆ سەربەخۆیت، ڕکابەریت و چێژ لە دروستکردنی بیرۆکەی نوێ وەردەگریت بەبێ ئەوەی پشت بە یاسا و نەریتەکانی ڕابردوو ببەستیت."],
  functions: [
    { name: "Ti", scale: [0, 1, 2, 3] }
  ]
},




{
    question: "خاڵە لاوازەکەت دیاری بکە",
    options: [
      "زۆر هەستیاریت و متمانە نیە بە هەستەکان زۆرجار کەسانی دیکە بە لاواز یان بە کەمتر دەبینیت. متمانەت بە هەستەکان نییە و لەوانەیە بە چاوی سووک سەیری ئەو کەسانە بکەیت کە کە پشت بە هەستەکان ئەبەستن وە لە هەمان کاتدا، کاردانەوەی توندت هەیە بەرامبەر بە ڕەخنەکان و بە کەسی وەریدەگریت.",
      "بێ متمانەیت و خراپەکاری تۆ بە توندی و ڕەخنەگرانە حوکم لەسەر کەسانی تر دەدەیت. متمانەت بە خەڵک نییە یان تەنها شوێن گروپەکە دەکەویت بۆ ئەوەی لەگەڵیاندا جێت ببێتەوە، سەرنجت لەسەر کامڵبوونە و شتەکان هەمووی بە باش یان خراپ دەبینیت."
    ],
functions: [
  { name: "Fi", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Te", scale: [0, 1, 2, 3] }
]
  },




{
    question: "خاڵە لاوازەکەت دیاری بکە",
    options: [
      "خەمۆکیت و بێ پاڵنەریت هەست بە کەمی و ماندووبوون و کەمی وزە دەکەیت بۆ ئەنجامدانی کارەکان. هەست بە سۆزداری و بێهەستی و تێنەگەیشتن دەکەیت. لەوانەیە بتەوێت هەموو شتێک پاک بکەیتەوە یان ڕێکیان بخەیت، یان زۆر نیگەران بیت لە تەندروستی خۆت.",
      "نیگەران و گوماناویت هەست بە نیگەرانی دەکەیت لە لەدەستدانی خەڵک یان تێکدانی پەیوەندییەکان. زۆرجار قسەکانی ئەوانی تر وەک ڕەخنە وەردەگری لەوانەیە لە هەموو شتێکدا مانای شاراوە یان تایبەت ببینیت."
    ],
functions: [
  { name: "Ni", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Se", scale: [0, 1, 2, 3] }
]
  },










































{
    question: "خاڵە لاوازەکەت دیاری بکە",
    options: [
      "هەستیار و تەنیایت بە ئاسانی هەست بە ئازار ئەکەیت زۆر هەستیار دەبیت، دەگریت یان هاوار دەکەیت. زۆر سەرنجت لەسەر وردەکاری بچووک یان سەلماندنی شتەکانە.",
      "ڕەخنەگریت و حوکمدانی توند دەدەیت. هەست بە پێویستی دەکەیت بۆ گرتنەبەری هەنگاو و ڕاستکردنەوەی ئەوەی کە بە هەڵە هەستی پێدەکەیت. هەست بە بێتوانایی دەکەیت، بەڵام هەوڵدەدەیت ڕێکوپێکی بهێنیتە ناو جیهانی دەرەوەی کۆنتڕۆڵەوە."
    ],
functions: [
  { name: "Fe", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Te", scale: [0, 1, 2, 3] }
]
  },








{
    question: "خاڵە لاوازەکەت دیاری بکە",
    options: [
      "هەست بە دڵەڕاوکێ دەکەیت و کەمتر لێبوردەییت بەرامبەر بە شتە نامۆکان تۆ بە شێوەیەکی ناتایبەتمەندی لەسەرخۆ و بێباکیت ناتوانیت خۆت بپارێزیت و هەموو ئەو ڕێگایانە لە خەیاڵتدا بپارێزیت کە کارەسات دەتوانێت لە گۆشەکەدا بێت",
      "بێباکانەیت هەست بە دڵەڕاوکێ و نائارامی ئەکەیت لەگەڵ شتە نوێیەکان. تۆ بە بێباکانە مامەڵە ئەکەیت و مەترسی دەکەیت  زۆرجار خەیاڵ دەکەیت کە شتێکی خراپ دەتوانێت ڕووبدات"
    ],
functions: [
  { name: "Si", scale: [0, 1, 2, 3] },  // low → super high
  { name: "Ne", scale: [0, 1, 2, 3] }
]
  },








  // Add more questions here...
];
